lkolbly/cmsis-svd/data/Atmel/ATSAMDA0J16A.svd
        <register>
          <name>PATTB</name>
          <description>Pattern Buffer</description>
          <addressOffset>0x64</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PGEB0</name>
              <description>Pattern Generator 0 Output Enable Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB1</name>
              <description>Pattern Generator 1 Output Enable Buffer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB2</name>
              <description>Pattern Generator 2 Output Enable Buffer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB3</name>
              <description>Pattern Generator 3 Output Enable Buffer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB4</name>
              <description>Pattern Generator 4 Output Enable Buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB5</name>
              <description>Pattern Generator 5 Output Enable Buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB6</name>
              <description>Pattern Generator 6 Output Enable Buffer</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB7</name>
              <description>Pattern Generator 7 Output Enable Buffer</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB0</name>
              <description>Pattern Generator 0 Output Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB1</name>
              <description>Pattern Generator 1 Output Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB2</name>
              <description>Pattern Generator 2 Output Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB3</name>
              <description>Pattern Generator 3 Output Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB4</name>
              <description>Pattern Generator 4 Output Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB5</name>
              <description>Pattern Generator 5 Output Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB6</name>
              <description>Pattern Generator 6 Output Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB7</name>
              <description>Pattern Generator 7 Output Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER</name>
          <description>Period</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER_DITH4</name>
          <description>Period</description>
          <alternateRegister>PER</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERCY</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER_DITH5</name>
          <description>Period</description>
          <alternateRegister>PER</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERCY</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER_DITH6</name>
          <description>Period</description>
          <alternateRegister>PER</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERCY</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERB</name>
          <description>Period Buffer</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PERB</name>
              <description>Period Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERB_DITH4</name>
          <description>Period Buffer</description>
          <alternateRegister>PERB</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERCYB</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PERB</name>
              <description>Period Buffer Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERB_DITH5</name>
          <description>Period Buffer</description>
          <alternateRegister>PERB</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERCYB</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PERB</name>
              <description>Period Buffer Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERB_DITH6</name>
          <description>Period Buffer</description>
          <alternateRegister>PERB</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERCYB</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PERB</name>
              <description>Period Buffer Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STOP</name>
              <description>Stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDX</name>
              <description>Ramp</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFS</name>
              <description>Non-Recoverable Debug Fault State</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLAVE</name>
              <description>Slave</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PATTBV</name>
              <description>Pattern Buffer Valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAVEBV</name>
              <description>Wave Buffer Valid</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERBV</name>
              <description>Period Buffer Valid</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULTAIN</name>
              <description>Recoverable Fault A Input</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULTBIN</name>
              <description>Recoverable Fault B Input</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT0IN</name>
              <description>Non-Recoverable Fault0 Input</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULT1IN</name>
              <description>Non-Recoverable Fault1 Input</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAULTA</name>
              <description>Recoverable Fault A State</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULTB</name>
              <description>Recoverable Fault B State</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULT0</name>
              <description>Non-Recoverable Fault 0 State</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAULT1</name>
              <description>Non-Recoverable Fault 1 State</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCBV0</name>
              <description>Compare Channel 0 Buffer Valid</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCBV1</name>
              <description>Compare Channel 1 Buffer Valid</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCBV2</name>
              <description>Compare Channel 2 Buffer Valid</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCBV3</name>
              <description>Compare Channel 3 Buffer Valid</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0</name>
              <description>Compare Channel 0 Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMP1</name>
              <description>Compare Channel 1 Value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMP2</name>
              <description>Compare Channel 2 Value</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMP3</name>
              <description>Compare Channel 3 Value</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Swrst Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTRLB</name>
              <description>Ctrlb Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATUS</name>
              <description>Status Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COUNT</name>
              <description>Count Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PATT</name>
              <description>Pattern Busy</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAVE</name>
              <description>Wave Busy</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC0</name>
              <description>Compare Channel 0 Busy</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1</name>
              <description>Compare Channel 1 Busy</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2</name>
              <description>Compare Channel 2 Busy</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC3</name>
              <description>Compare Channel 3 Busy</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PATTB</name>
              <description>Pattern Buffer Busy</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAVEB</name>
              <description>Wave Buffer Busy</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERB</name>
              <description>Period Buffer Busy</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCB0</name>
              <description>Compare Channel Buffer 0 Busy</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCB1</name>
              <description>Compare Channel Buffer 1 Busy</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCB2</name>
              <description>Compare Channel Buffer 2 Busy</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCB3</name>
              <description>Compare Channel Buffer 3 Busy</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
